import React from "react";
import { Container } from "react-bootstrap";

const style = { textIndent: "20px" };

export function AboutSite() {
  return (
    <Container fluid>
      <h2 className="text-center m-3">Відомості про Службу Військ</h2>
      <p style={style}>
        Для виконання завдань, які забезпечують належний статутний порядок,
        надійну охорону військових об’єктів, зміцнення військової дисципліни у
        військах (силах) організується службою військ.
      </p>
      <p style={style}>
        Основи організації служби військ в ЗСУ визначаються{" "}
        <b>
          Положенням про службу військ в ЗСУ, яке затверджено наказом начальника
          Генерального штабу ЗСУ від 01.07.2006 р. № 180.
        </b>
      </p>
      <p style={style}>
        СЛУЖБА ВІЙСЬК – це складова частина повсякденної діяльності військ (сил)
        яка спрямована на забезпечення необхідних умов життя, бойового навчання,
        побуту військ (сил), підтримання статутного порядку, військової
        дисципліни у гарнізонах і в/ч, а також на підтримання належної бойової,
        мобілізаційної готовності з’єднань, в/ч, окремих підрозділів.
      </p>
      <p style={style}>
        <b>Завдання</b> що стоять перед службою військ:
      </p>
      <ul>
        <li>
          організація і підтримання внутрішнього порядку у в/ч (підрозділі);
        </li>
        <li>
          правильний розподіл часу і контроль за виконанням розпорядку дня;
        </li>
        <li>
          визначення, підготовка і несення служби особовим складом добового
          наряду;
        </li>
        <li>
          організація надійної охорони і оборони місць розміщення підрозділів,
          складів зі зброєю, боєприпасами, пальним, парків та інших об’єктів;
        </li>
        <li>
          організація і проведення у гарнізоні будь-яких заходів щодо
          підтримання високої військової дисципліни і порядку;
        </li>
        <li>
          турбота про здоров’я і побут військовослужбовців і контроль за
          регулярністю проведення санітарно-гігієнічних заходів.
        </li>
      </ul>
      <p style={style}>
        Також до завдань служби військ належить організація{" "}
        <b>гарнізонної, вартової та внутрішньої служб.</b>
      </p>
      <p style={style}>Завдання ГАРНІЗОННОЇ СЛУЖБИ:</p>
      <ul>
        <li>
          підтримання високого рівня військової дисципліни і правопорядку,
          організація чергування, патрульно-постової служби, безпеки дорожнього
          руху тощо.
        </li>
      </ul>
      <p style={style}>Завдання ВАРТОВОЇ СЛУЖБИ:</p>
      <ul>
        <li>
          розробка документації з питань організації вартової служби тощо.
        </li>
      </ul>
      <p style={style}>Завдання ВНУТРІШНЬОЇ СЛУЖБИ:</p>
      <ul>
        <li>
          визначення старших у військових містечках; закріплення за в/ч і
          підрозділами адміністративного та казарменого фонду тощо.
        </li>
      </ul>
    </Container>
  );
}
